app/controllers/atletas_controller.rb

SELECT "atletas".* FROM "atletas"
---
  def index
    @atletas = Atleta.all

INSERT INTO "atletas" ("nome", "email", "telefone", "data_nascimento", "cpf", "rg", "posicao_joga", "categoria", "alojamento_clube", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @atleta = Atleta.new(atleta_params)

    respond_to do |format|
      if @atleta.save

SELECT  "atletas".* FROM "atletas" WHERE "atletas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_atleta
      @atleta = Atleta.find(params[:id])