app/controllers/clausulas_controller.rb

SELECT "clausulas".* FROM "clausulas"
---
  def index
    @clausulas = Clausula.all

INSERT INTO "clausulas" ("titulo", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titulo", ""], ["descricao", ""], ["created_at", "2015-06-24 16:48:52.837165"], ["updated_at", "2015-06-24 16:48:52.837165"]]
---
  def create
    @clausula = Clausula.new(clausula_params)

    respond_to do |format|
      if @clausula.save

DELETE FROM "clausulas" WHERE "clausulas"."id" = ?  [["id", 1]]
---
  def destroy
    @clausula.destroy

SELECT  "clausulas".* FROM "clausulas" WHERE "clausulas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_clausula
      @clausula = Clausula.find(params[:id])