app/controllers/contratos_controller.rb

  def index
    @contratos = Contrato.all
---
SELECT "contratos".* FROM "contratos"

  def create
    @contrato = Contrato.new(contrato_params)

    respond_to do |format|
      if @contrato.save
---
INSERT INTO "contratos" ("atleta_id", "contrata", "valor", "data_Inicio", "data_Termino", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @contrato.update(contrato_params)
---
UPDATE "contratos" SET "atleta_id" = ?, "updated_at" = ? WHERE "contratos"."id" = ?  [["atleta_id", 0], ["updated_at", "2015-06-24 16:53:50.475285"], ["id", 2]]

    def set_contrato
      @contrato = Contrato.find(params[:id])
---
SELECT  "contratos".* FROM "contratos" WHERE "contratos"."id" = ? LIMIT 1  [["id", 2]]