app/controllers/partidas_controller.rb

SELECT "partidas".* FROM "partidas"
---
  def index
    @partidas = Partida.all

INSERT INTO "partidas" ("nome", "tag", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Nauti e Sport"], ["tag", "Serie A"], ["data", "2015-06-02 19:01:00.000000"], ["created_at", "2015-06-02 19:01:47.278648"], ["updated_at", "2015-06-02 19:01:47.278648"]]
---
  def create
    @partida = Partida.new(partida_params)

    respond_to do |format|
      if @partida.save

SELECT  "partidas".* FROM "partidas" WHERE "partidas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_partida
      @partida = Partida.find(params[:id])